samples <- function(s, alpha = 0.5) {
  n <- length(s)  # Розмір вибірки
  k <- floor(n * alpha / 2)  # Кількість елементів для видалення
  
  # Якщо k дорівнює 0, повертаємо вихідну вибірку, адже при значенні alpha = 0.05,
  # ціле число для видалення в основному буде 0
  if (k == 0) return(s)
  
  # Сортуємо вибірку для визначення найменших та найбільших
  x <- sort(s)
  
  # Отримуємо найменші та найбільші елементи
  min <- x[1:k]  # k найменших значень для видалення
  max <- x[(n - k + 1):n]  # k найбільших значень для видалення
  
  # Вилучаємо найменші та найбільші значення, зберігаючи порядок
  result <- s[!(s %in% min | s %in% max)]
  
  return(result)
}


# samples(c(15, 2, 16, 8, 1, 13)) приклад того що треба ввести в консоль,
# це можуть бути будь-які ваші числа, також за потреби ви можете змінити значення alpha  в коді








