calculate_series <- function(alpha, delta = 1e-6, max_iter = 10000) {
  # Перевірка умов збіжності ряду
  if (alpha >= -1) {
    stop("порушені умови збіжності ряду")
  }
  
  # Ініціалізація початкових змінних
  S_m <- 0  # S_m = часткова сума на ітерації m
  S_m_plus_1 <- 0  # S_m_plus_1 = часткова сума на ітерації m + 1
  m <- 1
  
  repeat {
    # Додавання нового члена ряду
    S_m_plus_1 <- S_m + m^alpha
    
    # Перевірка точності
    if (abs(S_m_plus_1 - S_m) < delta) {
      return(S_m_plus_1)  # Якщо досягнута потрібна точність
    }
    
    # Оновлення попередньої суми
    S_m <- S_m_plus_1
    m <- m + 1
    
    # Перевірка кількості ітерацій
    if (m > max_iter) {
      stop("перевищена кількість допустимих ітерацій")
    }
  }
}
result <- calculate_series(alpha = -3, delta = 1e-6, max_iter = 10000)
print(result)
# альфа може бути довільне(якщо виконуються умови), дельта і макс ітерація- з умови
# можна викликати result в консолі або використати: print(result)




